packages/fxa-shared/test/fixtures/stripe/customer1_with_subscription.json

{
  "id": "cust_new",
  "object": "customer",
  "address": null,
  "balance": 0,
  "created": 1594080587,
  "currency": null,
  "default_source": "card_1H24NbBVqmGyQTMaTqA11Ihj",
  "delinquent": false,
  "description": "430eed4248ad447bab8be92cdaaa4f98",
  "discount": null,
  "email": "test@example.com",
  "invoice_prefix": "E595BC81",
  "invoice_settings": {
    "custom_fields": null,
    "default_payment_method": null,
    "footer": null
  },
  "livemode": false,
  "metadata": {
    "userid": "430eed4248ad447bab8be92cdaaa4f98"
  },
  "name": "Jane Doe",
  "next_invoice_sequence": 1,
  "phone": null,
  "preferred_locales": [],
  "shipping": null,
  "sources": {
    "object": "list",
    "data": [
      {
        "id": "card_1H24NbBVqmGyQTMaTqA11Ihj",
        "object": "card",
        "address_city": null,
        "address_country": null,
        "address_line1": null,
        "address_line1_check": null,
        "address_line2": null,
        "address_state": null,
        "address_zip": "12345",
        "address_zip_check": "pass",
        "brand": "Visa",
        "country": "US",
        "customer": "cust_new",
        "cvc_check": "pass",
        "dynamic_last4": null,
        "exp_month": 12,
        "exp_year": 2021,
        "fingerprint": "PXj5xzTtGdBo1fVl",
        "funding": "credit",
        "last4": "4242",
        "metadata": {},
        "name": "Jane Doe",
        "tokenization_method": null
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/customers/cust_new/sources"
  },
  "subscriptions": {
    "object": "list",
    "data": [
      {
        "id": "sub_HbadgOVyxa8z64",
        "object": "subscription",
        "application_fee_percent": null,
        "billing_cycle_anchor": 1594153896,
        "billing_thresholds": null,
        "cancel_at": null,
        "cancel_at_period_end": false,
        "canceled_at": null,
        "collection_method": "charge_automatically",
        "created": 1594153896,
        "current_period_end": 1596832296,
        "current_period_start": 1594153896,
        "customer": "cust_new",
        "days_until_due": null,
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [],
        "discount": null,
        "ended_at": null,
        "items": {
          "object": "list",
          "data": [
            {
              "id": "si_HbadY1rCF1Vz8D",
              "object": "subscription_item",
              "billing_thresholds": null,
              "created": 1594153896,
              "metadata": {},
              "plan": {
                "id": "plan_HQSB6TJ0bXZPya",
                "object": "plan",
                "active": true,
                "aggregate_usage": null,
                "amount": 499,
                "amount_decimal": "499",
                "billing_scheme": "per_unit",
                "created": 1591585459,
                "currency": "usd",
                "interval": "month",
                "interval_count": 1,
                "livemode": false,
                "metadata": {},
                "nickname": null,
                "product": "prod_GjeDrVtBRfiWjm",
                "tiers": null,
                "tiers_mode": null,
                "transform_usage": null,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "price": {
                "id": "plan_HQSB6TJ0bXZPya",
                "object": "price",
                "active": true,
                "billing_scheme": "per_unit",
                "created": 1591585459,
                "currency": "usd",
                "livemode": false,
                "lookup_key": null,
                "metadata": {},
                "nickname": null,
                "product": "prod_GjeDrVtBRfiWjm",
                "recurring": {
                  "aggregate_usage": null,
                  "interval": "month",
                  "interval_count": 1,
                  "trial_period_days": null,
                  "usage_type": "licensed"
                },
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "recurring",
                "unit_amount": 499,
                "unit_amount_decimal": "499"
              },
              "quantity": 1,
              "subscription": "sub_HbadgOVyxa8z64",
              "tax_rates": []
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/subscription_items?subscription=sub_HbadgOVyxa8z64"
        },
        "latest_invoice": "in_1H2NS0BVqmGyQTMauvK5Bxfc",
        "livemode": false,
        "metadata": {},
        "next_pending_invoice_item_invoice": null,
        "pause_collection": null,
        "pending_invoice_item_interval": null,
        "pending_setup_intent": null,
        "pending_update": null,
        "plan": {
          "id": "plan_HQSB6TJ0bXZPya",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 499,
          "amount_decimal": "499",
          "billing_scheme": "per_unit",
          "created": 1591585459,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "product": "prod_GjeDrVtBRfiWjm",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "quantity": 1,
        "schedule": null,
        "start_date": 1594153896,
        "status": "incomplete",
        "tax_percent": null,
        "transfer_data": null,
        "trial_end": null,
        "trial_start": null
      }
    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/cust_new/subscriptions"
  },
  "tax_exempt": "none",
  "tax_ids": {
    "object": "list",
    "data": [],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/customers/cust_new/tax_ids"
  }
}
