packages/fxa-shared/test/fixtures/stripe/price1_with_product.json

{
  "id": "plan_HT8AZvuL6bN565",
  "object": "price",
  "active": true,
  "billing_scheme": "per_unit",
  "created": 1592202877,
  "currency": "usd",
  "livemode": false,
  "lookup_key": null,
  "metadata": {
    "capabilities": "testForAllClients, foo",
    "capabilities:dcdb5ae7add825d2": "123donePro,     gogogo",
    "downloadURL": "http://127.0.0.1:8080/",
    "webIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
    "emailIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
    "productSet": "123done",
    "productOrder": "0"
  },
  "nickname": null,
  "product": {
    "id": "prod_GqM9ToKK62qjkK",
    "object": "product",
    "active": true,
    "attributes": [],
    "created": 1583259938,
    "description": null,
    "images": [],
    "livemode": false,
    "metadata": {
      "capabilities": "testForAllClients, foo",
      "capabilities:dcdb5ae7add825d2": "123donePro,     gogogo",
      "downloadURL": "http://127.0.0.1:8080/",
      "webIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
      "emailIconURL": "https://123done-stage.dev.lcip.org/img/transparent-logo.png",
      "productSet": "123done",
      "productOrder": "0"
    },
    "name": "123Done Pro",
    "statement_descriptor": null,
    "type": "service",
    "unit_label": null,
    "updated": 1591393664
  },
  "recurring": {
    "aggregate_usage": null,
    "interval": "day",
    "interval_count": 1,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "tiers_mode": null,
  "transform_quantity": null,
  "type": "recurring",
  "unit_amount": 999,
  "unit_amount_decimal": "999"
}
