packages/fxa-shared/test/fixtures/stripe/subscription_expanded.json

{
  "id": "sub_HbGu2EjvFQpuD2",
  "object": "subscription",
  "application_fee_percent": null,
  "billing_cycle_anchor": 1594080506,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1594080506,
  "current_period_end": 1596758906,
  "current_period_start": 1594080506,
  "customer": "cust_new",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": null,
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_HbGuN6rZTAdi4Z",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1594080506,
        "metadata": {},
        "plan": {
          "id": "plan_GqM9N6qyhvxaVk",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 500,
          "amount_decimal": "500",
          "billing_scheme": "per_unit",
          "created": 1583259953,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": "123Done Pro Monthly",
          "product": "prod_GqM9ToKK62qjkK",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "plan_GqM9N6qyhvxaVk",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1583259953,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": "123Done Pro Monthly",
          "product": "prod_GqM9ToKK62qjkK",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 500,
          "unit_amount_decimal": "500"
        },
        "quantity": 1,
        "subscription": "sub_HbGu2EjvFQpuD2",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_HbGu2EjvFQpuD2"
  },
  "latest_invoice": {
    "id": "in_1H24MIBVqmGyQTMaaaBNXB0C",
    "object": "invoice",
    "account_country": "US",
    "account_name": "SUB_PLAT_DEV",
    "amount_due": 500,
    "amount_paid": 500,
    "amount_remaining": 0,
    "application_fee_amount": null,
    "attempt_count": 1,
    "attempted": true,
    "auto_advance": false,
    "billing_reason": "subscription_create",
    "charge": "ch_1H24MJBVqmGyQTMaI3hdW8d4",
    "collection_method": "charge_automatically",
    "created": 1594080506,
    "currency": "usd",
    "custom_fields": null,
    "customer": "cust_new",
    "customer_address": null,
    "customer_email": "test@example.com",
    "customer_name": "Jane Doe",
    "customer_phone": null,
    "customer_shipping": null,
    "customer_tax_exempt": "none",
    "customer_tax_ids": [],
    "default_payment_method": null,
    "default_source": null,
    "default_tax_rates": [],
    "description": null,
    "discount": null,
    "due_date": null,
    "ending_balance": 0,
    "footer": null,
    "hosted_invoice_url": "https://pay.stripe.com/invoice/acct_1GCAr3BVqmGyQTMa/invst_HbGuRujVERsyXZy0zArp7SLFRhY9i6S",
    "invoice_pdf": "https://pay.stripe.com/invoice/acct_1GCAr3BVqmGyQTMa/invst_HbGuRujVERsyXZy0zArp7SLFRhY9i6S/pdf",
    "lines": {
      "object": "list",
      "data": [
        {
          "id": "il_1H24MIBVqmGyQTMa2hcoK0YW",
          "object": "line_item",
          "amount": 500,
          "currency": "usd",
          "description": "1 × 123Done Pro (at $5.00 / month)",
          "discountable": true,
          "livemode": false,
          "metadata": {},
          "period": {
            "end": 1596758906,
            "start": 1594080506
          },
          "plan": {
            "id": "plan_GqM9N6qyhvxaVk",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 500,
            "amount_decimal": "500",
            "billing_scheme": "per_unit",
            "created": 1583259953,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "nickname": "123Done Pro Monthly",
            "product": "prod_GqM9ToKK62qjkK",
            "tiers": null,
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "price": {
            "id": "plan_GqM9N6qyhvxaVk",
            "object": "price",
            "active": true,
            "billing_scheme": "per_unit",
            "created": 1583259953,
            "currency": "usd",
            "livemode": false,
            "lookup_key": null,
            "metadata": {},
            "nickname": "123Done Pro Monthly",
            "product": "prod_GqM9ToKK62qjkK",
            "recurring": {
              "aggregate_usage": null,
              "interval": "month",
              "interval_count": 1,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "tiers_mode": null,
            "transform_quantity": null,
            "type": "recurring",
            "unit_amount": 500,
            "unit_amount_decimal": "500"
          },
          "proration": false,
          "quantity": 1,
          "subscription": "sub_HbGu2EjvFQpuD2",
          "subscription_item": "si_HbGuN6rZTAdi4Z",
          "tax_amounts": [],
          "tax_rates": [],
          "type": "subscription"
        }
      ],
      "has_more": false,
      "total_count": 1,
      "url": "/v1/invoices/in_1H24MIBVqmGyQTMaaaBNXB0C/lines"
    },
    "livemode": false,
    "metadata": {},
    "next_payment_attempt": null,
    "number": "5F033D48-0001",
    "paid": true,
    "payment_intent": {
      "id": "pi_1H24MIBVqmGyQTMarpgx9Emm",
      "object": "payment_intent",
      "amount": 500,
      "amount_capturable": 0,
      "amount_received": 500,
      "application": null,
      "application_fee_amount": null,
      "canceled_at": null,
      "cancellation_reason": null,
      "capture_method": "automatic",
      "charges": {
        "object": "list",
        "data": [
          {
            "id": "ch_1H24MJBVqmGyQTMaI3hdW8d4",
            "object": "charge",
            "amount": 500,
            "amount_refunded": 0,
            "application": null,
            "application_fee": null,
            "application_fee_amount": null,
            "balance_transaction": "txn_1H24MJBVqmGyQTMamhw5t9r5",
            "billing_details": {
              "address": {
                "city": null,
                "country": null,
                "line1": null,
                "line2": null,
                "postal_code": "12345",
                "state": null
              },
              "email": null,
              "name": "Jane Doe",
              "phone": null
            },
            "calculated_statement_descriptor": "Stripe",
            "captured": true,
            "created": 1594080507,
            "currency": "usd",
            "customer": "cust_new",
            "description": "Subscription creation",
            "destination": null,
            "dispute": null,
            "disputed": false,
            "failure_code": null,
            "failure_message": null,
            "fraud_details": {},
            "invoice": "in_1H24MIBVqmGyQTMaaaBNXB0C",
            "livemode": false,
            "metadata": {},
            "on_behalf_of": null,
            "order": null,
            "outcome": {
              "network_status": "approved_by_network",
              "reason": null,
              "risk_level": "normal",
              "risk_score": 56,
              "seller_message": "Payment complete.",
              "type": "authorized"
            },
            "paid": true,
            "payment_intent": "pi_1H24MIBVqmGyQTMarpgx9Emm",
            "payment_method": "card_1H24MHBVqmGyQTMaYjss8H5B",
            "payment_method_details": {
              "card": {
                "brand": "visa",
                "checks": {
                  "address_line1_check": null,
                  "address_postal_code_check": "pass",
                  "cvc_check": "pass"
                },
                "country": "US",
                "exp_month": 12,
                "exp_year": 2021,
                "fingerprint": "PXj5xzTtGdBo1fVl",
                "funding": "credit",
                "installments": null,
                "last4": "4242",
                "network": "visa",
                "three_d_secure": null,
                "wallet": null
              },
              "type": "card"
            },
            "receipt_email": null,
            "receipt_number": null,
            "receipt_url": "https://pay.stripe.com/receipts/acct_1GCAr3BVqmGyQTMa/ch_1H24MJBVqmGyQTMaI3hdW8d4/rcpt_HbGuEn4As8B2hleT37ZV4dVmAH5Mr70",
            "refunded": false,
            "refunds": {
              "object": "list",
              "data": [],
              "has_more": false,
              "total_count": 0,
              "url": "/v1/charges/ch_1H24MJBVqmGyQTMaI3hdW8d4/refunds"
            },
            "review": null,
            "shipping": null,
            "source": {
              "id": "card_1H24MHBVqmGyQTMaYjss8H5B",
              "object": "card",
              "address_city": null,
              "address_country": null,
              "address_line1": null,
              "address_line1_check": null,
              "address_line2": null,
              "address_state": null,
              "address_zip": "12345",
              "address_zip_check": "pass",
              "brand": "Visa",
              "country": "US",
              "customer": "cust_new",
              "cvc_check": "pass",
              "dynamic_last4": null,
              "exp_month": 12,
              "exp_year": 2021,
              "fingerprint": "PXj5xzTtGdBo1fVl",
              "funding": "credit",
              "last4": "4242",
              "metadata": {},
              "name": "Jane Doe",
              "tokenization_method": null
            },
            "source_transfer": null,
            "statement_descriptor": null,
            "statement_descriptor_suffix": null,
            "status": "succeeded",
            "transfer_data": null,
            "transfer_group": null
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/charges?payment_intent=pi_1H24MIBVqmGyQTMarpgx9Emm"
      },
      "client_secret": "pi_1H24MIBVqmGyQTMarpgx9Emm_secret_6RBjV10PFqdS8WBlFRkB7hbF9",
      "confirmation_method": "automatic",
      "created": 1594080506,
      "currency": "usd",
      "customer": "cust_new",
      "description": "Subscription creation",
      "invoice": "in_1H24MIBVqmGyQTMaaaBNXB0C",
      "last_payment_error": null,
      "livemode": false,
      "metadata": {},
      "next_action": null,
      "on_behalf_of": null,
      "payment_method": null,
      "payment_method_options": {
        "card": {
          "installments": null,
          "network": null,
          "request_three_d_secure": "automatic"
        }
      },
      "payment_method_types": ["card"],
      "receipt_email": null,
      "review": null,
      "setup_future_usage": "off_session",
      "shipping": null,
      "source": "card_1H24MHBVqmGyQTMaYjss8H5B",
      "statement_descriptor": null,
      "statement_descriptor_suffix": null,
      "status": "succeeded",
      "transfer_data": null,
      "transfer_group": null
    },
    "period_end": 1594080506,
    "period_start": 1594080506,
    "post_payment_credit_notes_amount": 0,
    "pre_payment_credit_notes_amount": 0,
    "receipt_number": null,
    "starting_balance": 0,
    "statement_descriptor": null,
    "status": "paid",
    "status_transitions": {
      "finalized_at": 1594080506,
      "marked_uncollectible_at": null,
      "paid_at": 1594080506,
      "voided_at": null
    },
    "subscription": "sub_HbGu2EjvFQpuD2",
    "subtotal": 500,
    "tax": null,
    "tax_percent": null,
    "total": 500,
    "total_tax_amounts": [],
    "transfer_data": null,
    "webhooks_delivered_at": null
  },
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "pause_collection": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "plan_GqM9N6qyhvxaVk",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 500,
    "amount_decimal": "500",
    "billing_scheme": "per_unit",
    "created": 1583259953,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": "123Done Pro Monthly",
    "product": "prod_GqM9ToKK62qjkK",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start_date": 1594080506,
  "status": "active",
  "tax_percent": null,
  "transfer_data": null,
  "trial_end": null,
  "trial_start": null
}
